{
    "header": {
        "whyMe": "Warum ich",
        "skills": "Fähigkeiten",
        "projects": "Projekte",
        "contact": "Kontakt"
    },
    "intro": {
        "contactMe": "KONTAKTIERE MICH",
        "jobTitle": "FULLSTACK ENTWICKLER"
    },
    "whyMe": {
        "headline": "Warum ich",
        "textAboutMe": "Hallo, ich bin Tom. Ich bin zertifizierter Full-Stack-Entwickler mit Kenntnissen in Angular, TypeScript, Python und Django. Programmieren macht mir Spaß, weil es mir die Möglichkeit gibt, neue Technologien und Ansätze kennenzulernen. Ich habe bereits viele Probleme in verschiedenen Projekten gelöst, was mir viel Spaß gemacht hat.",
        "textLetsTalk": "Lass uns reden"
    },
    "mySkills": {
        "headline": "Meine Fähigkeiten",
        "challengeMe": "Fordere mich heraus",
        "challengeMeText": "Ich freue mich immer, neue Technologien zu lernen. Sag mir einfach, was du brauchst."
    },
    "myProjects": {
        "headline": "Meine Projekte",
        "descriptionDABubble": "Ein Chat-Messenger-Klon wie Slack. Erstellen Sie Kanäle zu bestimmten Themen. Oder schreiben Sie Direktnachrichten an andere Benutzer.",
        "descriptionJoin": "Ein Kanban-Board-Klon wie Jira. Aufgaben erstellen und organisieren. Aufgaben per Drag & Drop verschieben. Neue Kontakte erstellen und den Aufgaben zuordnen.",
        "descriptionSharkie": "Ein Jump-and-Run-Spiel unter Wasser basierend auf objektorientierter Programmierung. Sammle Münzen und Giftflaschen. Kämpfe am Ende des Spiels gegen den großen Hai.",
        "descriptionCoderr": "Eine einfache Variante der Plattform Fiverr. Erstellen Sie Angebote oder bearbeiten Sie Aufträge als Geschäftskunde. Erstellen Sie Bewertungen oder geben Sie Aufträge als Endkunde auf.",
        "descriptionKanmind": "Ein Kanban-Board-Klon wie Trello. Erstellen, organisieren und verwalten Sie Aufgaben im Board. Verschieben Sie Aufgaben per Drag & Drop. Informationen zu Boards und Aufgaben erhalten Sie im Dashboard."
    },
    "contactMe": {
        "headline": "Kontaktiere mich",
        "text": "Ich freue mich auf deine Kontaktaufnahme! Besonders die Rolle als Fullstack Entwickler interessiert mich. Die Möglichkeit, Projekte mitzugestalten und Ideen im Team umzusetzen, reizt mich.",
        "placeholders": {
            "name": "Dein Name",
            "email": "Deine Email",
            "message": "Deine Nachricht"
        },
        "successMessages": {
            "name": "Name eingegeben",
            "email": "Gültige E-Mail eingegeben",
            "message": "Nachricht eingegeben"
        },
        "errorMessages": {
            "name": "Dein Name ist erforderlich",
            "email": {
                "required": "Deine Email ist erforderlich",
                "invalid": "Deine Email ist ungültig"
            },
            "message": "Deine Nachricht ist erforderlich",
            "privacyPolicy": "Bitte akzeptiere die Datenschutzbestimmungen"
        },
        "privacyPolicy": {
            "startText": "Ich habe die",
            "link": "Datenschutzerklärung",
            "endText": "gelesen und stimme der Verarbeitung meiner Daten zu."
        },
        "buttonText": "Senden"
    },
    "footer": {
        "jobTitle": "fullstack entwickler",
        "legalNoticeLink": "Impressum",
        "privacyPolicyLink": "Datenschutzerklärung"
    }
}