{
    "header": {
        "whyMe": "Why me",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact"
    },
    "intro": {
        "contactMe": "CONTACT ME",
        "jobTitle": "FULLSTACK DEVELOPER"
    },
    "whyMe": {
        "headline": "Why me",
        "textAboutMe": "Hi, I'm Tom. I'm a certified full-stack developer with knowledge of Angular, TypeScript, Python, and Django. I enjoy programming because it gives me the opportunity to learn new technologies and approaches. I've already solved many problems in various projects, which I've really enjoyed.",
        "textLetsTalk": "Let's talk"
    },
    "mySkills": {
        "headline": "My Skills",
        "challengeMe": "Challenge me",
        "challengeMeText": "I am always happy to learn new technologies, just tell me what you need."
    },
    "myProjects": {
        "headline": "My Projects",
        "descriptionDABubble": "A chat messenger clone like Slack. Create Channel to specific Topics. Or write direct messages to other user.",
        "descriptionJoin": "A Kanban board clone like Jira. Create, organize Tasks. Move Tasks with drag and drop. Create new Contacts and assign them to the Tasks.",
        "descriptionSharkie": "A jump and run game under water based on object-oriented progarmming. Collect Coins and poison bottles. Fight against the big Shark at the end of the game.",
        "descriptionCoderr": "A simple variant of the platform Fiverr. Create offers or edit orders as business user. Create reviews or place orders as customer user.",
        "descriptionKanmind": "A Kanban board clone like Trello. Create, boards and organize Tasks wihin the board. Move Tasks with drag and drop. Get infos about boards and Tasks in the Dashboard."
    },
    "contactMe": {
        "headline": "Contact me",
        "text": "I look forward to hearing from you! I'm particularly interested in the role of full-stack developer. The opportunity to help shape projects and implement ideas as part of a team appeals to me.",
        "placeholders": {
            "name": "Your Name",
            "email": "Your Email",
            "message": "Your Message"
        },
        "successMessages": {
            "name": "Name entered",
            "email": "Valid email entered",
            "message": "Message entered"
        },
        "errorMessages": {
            "name": "Your name is required",
            "email": {
                "required": "Your email is required",
                "invalid": "Your email is invalid"
            },
            "message": "Your message is required",
            "privacyPolicy": "Please accept the privacy policy"
        },
        "privacyPolicy": {
            "startText": "I have read the",
            "link": "privacy policy",
            "endText": "and agree to the processing of my data."
        },
        "buttonText": "Send"
    },
    "footer": {
        "jobTitle": "fullstack developer",
        "legalNoticeLink": "Legal notice",
        "privacyPolicyLink": "privacy policy"
    },
    "pageNotFound": {
        "headline": "404 Page not found",
        "firstText": "The entered address don't exist!",
        "secondText": "Please check your input or go back to the previous Page."
    },
    "legalNotice": {
        "headline": "Imprint",
        "secondHeadline": "Information according to 5 TMG",
        "contact": "Contact",
        "source": "Source:",
        "logoMadeBy": "Logo made by:"
    },
    "privacyPolicy": {
        "headline": "Privacy Policy",
        "privacyAtAGlance": {
            "privacyAtAGlanceHeadline": "1. Privacy at a Glance",
            "generalInfoHeadline": "General Information",
            "generalInfoText": "The following notes provide a simple overview of what happens to your personal data when you visit this website. Personal data is any information that can identify you personally. Detailed information on data protection can be found in our privacy policy listed below this text.",
            "dataCollectionHeadline": "Data Collection on This Website",
            "whoIsResponsibleHeadline": "Who is responsible for data collection on this website?",
            "whoIsResponsibleText": "Data processing on this website is carried out by the website operator. You can find their contact details in the section 'Information on the Responsible Party' in this privacy policy.",
            "howWeCollectHeadline": "How do we collect your data?",
            "howWeCollectText1": "Your data is collected in two ways: by you providing it to us, e.g., when filling out a contact form.",
            "howWeCollectText2": "Other data is collected automatically or with your consent when visiting the website through our IT systems. This mainly includes technical data (e.g., web browser, operating system, or time of page access). This data collection occurs automatically as soon as you access the website.",
            "whatWeUseForHeadline": "What do we use your data for?",
            "whatWeUseForText": "Some data is collected to ensure the error-free provision of the website. Other data can be used to analyze your user behavior.",
            "yourRightsHeadline": "What rights do you have regarding your data?",
            "yourRightsText1": "You have the right at any time to obtain free information about the origin, recipients, and purpose of your stored personal data. You also have the right to request the correction or deletion of this data. If you have given consent to data processing, you can withdraw this consent at any time for the future. You also have the right to request the restriction of the processing of your personal data under certain circumstances. Furthermore, you have the right to lodge a complaint with the competent supervisory authority.",
            "yourRightsText2": "For this and further questions about data protection, you can contact us at any time."
        },
        "generalInformationAndMandatoryDisclosures": {
            "headline": "2. General Information and Mandatory Disclosures",
            "dataProtectionHeadline": "Data Protection",
            "dataProtection": "The operators of this site take the protection of your personal data very seriously. We handle your personal data confidentially and in accordance with legal data protection regulations as well as this privacy policy.",
            "usageExplanation": "When you use this website, various personal data is collected. Personal data is data that can identify youpersonally. This privacy policy explains what data we collect and what we use it for. It also explains howand for what purpose this occurs.",
            "securityNote": "We point out that data transmission over the Internet (e.g., communication via email) can have security gaps. Complete protection of data from access by third parties is not possible.",
            "responsiblePartyHeadline": "Information on the Responsible Party",
            "responsibleParty": "The responsible party for data processing on this website is:",
            "responsiblePartySecondParagraph": "The responsible party is the natural or legal person who, alone or jointly with others, determines thepurposes and means of processing personal data (e.g., names, email addresses, etc.).",
            "dataRetentionHeadline": "Data Retention Period",
            "dataRetention": "Unless a more specific retention period is mentioned in this privacy policy, your personal data will remainwith us until the purpose for data processing no longer applies. If you assert a legitimate deletion requestor withdraw consent to data processing, your data will be deleted, provided we have no other legally permissible reasons for retaining your personal data (e.g., tax or commercial retention periods); in the latter case, deletion occurs after these reasons cease to apply.",
            "legalBasisHeadline": "General Information on the Legal Basis for Data Processing on This Website",
            "legalBasis": "If you have given consent to data processing, we process your personal data based on Art. 6(1)(a) GDPR or Art. 9(2)(a) GDPR, if special categories of data pursuant to Art. 9(1) GDPR are processed. In the case of explicit consent to the transfer of personal data to third countries, data processing also takes place on the basis of Art. 49(1)(a) GDPR. If you have consented to the storage of cookies or access to information on your device (e.g., via device fingerprinting), data processing also occurs on the basis of ยง25(1) TTDSG. Consent can be revoked at any time. If your data is required to fulfill a contract or for pre-contractual measures, we process your data on the basis of Art. 6(1)(b) GDPR. Furthermore, we process your data if it is necessary to fulfill a legal obligation based on Art. 6(1)(c) GDPR. Data processing may also be based on our legitimate interest according to Art. 6(1)(f) GDPR. The applicable legal basis in each individual case is specified in the following sections of this privacy policy.",
            "revocationHeadline": "Revocation of Your Consent to Data Processing",
            "revocation": "Many data processing operations are only possible with your explicit consent. You can revoke consent already given at any time. The legality of the data processing carried out up to the revocation remains unaffected by the revocation.",
            "objectionHeadline": "Right to Object in Certain Cases and Against Direct Marketing (Art. 21 GDPR)",
            "objectionText1": "IF DATA PROCESSING IS BASED ON ART. 6(1)(E) OR (F) GDPR, YOU HAVE THE RIGHT TO OBJECT AT ANY TIME FOR REASONS ARISING FROM YOUR PARTICULAR SITUATION TO THE PROCESSING OF YOUR PERSONAL DATA; THIS ALSO APPLIES TO PROFILING BASED ON THESE PROVISIONS. THE RESPECTIVE LEGAL BASIS ON WHICH PROCESSING IS BASED CAN BE FOUND IN THIS PRIVACY POLICY. IF YOU OBJECT, WE WILL NO LONGER PROCESS YOUR AFFECTED PERSONAL DATA, UNLESS WE CAN DEMONSTRATE COMPELLING LEGITIMATE GROUNDS FOR PROCESSING WHICH OVERRIDE YOUR INTERESTS, RIGHTS, AND FREEDOMS OR THE PROCESSING SERVES THE ASSERTION, EXERCISE, OR DEFENSE OF LEGAL CLAIMS (OBJECTION ACCORDING TO ART. 21(1) GDPR).",
            "objectionText2": "IF YOUR PERSONAL DATA IS PROCESSED FOR DIRECT MARKETING, YOU HAVE THE RIGHT TO OBJECT AT ANY TIME TO THE PROCESSING OF YOUR PERSONAL DATA FOR SUCH ADVERTISING; THIS ALSO APPLIES TO PROFILING IN CONNECTION WITH SUCH DIRECT MARKETING. IF YOU OBJECT, YOUR PERSONAL DATA WILL NO LONGER BE USED FOR DIRECT MARKETING PURPOSES (OBJECTION ACCORDING TO ART. 21(2) GDPR).",
            "complaintHeadline": "Right to Lodge a Complaint with the Competent Supervisory Authority",
            "complaintText": "In case of violations of the GDPR, data subjects have the right to lodge a complaint with a supervisory authority, especially in the member state of their habitual residence, place of work, or the location of the alleged violation. This right to complain exists without prejudice to other administrative or judicial remedies.",
            "dataPortabilityHeadline": "Right to Data Portability",
            "dataPortabilityText": "You have the right to receive data that we process automatically based on your consent or to fulfill a contract, and to have it transmitted to yourself or a third party in a commonly used, machine-readable format. If you request direct transfer of the data to another controller, this will only be done if technically feasible.",
            "accessDeletionCorrectionHeadline": "Right to Access, Deletion, and Correction",
            "accessDeletionCorrectionText": "You have the right, within the framework of applicable legal provisions, to obtain free information about your stored personal data, its origin, recipients, and the purpose of data processing, and if necessary, the right to correct or delete this data. For this and further questions on personal data, you can contact us at any time.",
            "restrictProcessingHeadline": "Right to Restrict Processing",
            "restrictProcessingIntro": "You have the right to request the restriction of processing of your personal data. You can contact us at any time for this. The right to restrict processing exists in the following cases:",
            "restrictProcessingCase1": "If you dispute the accuracy of your personal data stored with us, we usually need time to verify this. During this period, you have the right to request restriction of processing.",
            "restrictProcessingCase2": "If the processing of your personal data was/is unlawful, you can request restriction instead of deletion.",
            "restrictProcessingCase3": "If we no longer need your personal data but you need it to assert, exercise, or defend legal claims, you have the right to request restriction instead of deletion.",
            "restrictProcessingCase4": "If you have objected under Art. 21(1) GDPR, a balancing of interests must be carried out. As long as it is not yet clear whose interests prevail, you have the right to request restriction.",
            "restrictProcessingConclusion": "If you have restricted processing of your personal data, this data may only be processed - aside from storage - with your consent or to assert, exercise, or defend legal claims, to protect the rights of another natural or legal person, or for reasons of important public interest of the EU or a member state.",
            "sslHeadline": "SSL or TLS Encryption",
            "sslText1": "For security reasons and to protect the transmission of confidential content, such as orders or inquiries you send to us as site operators, this site uses SSL or TLS encryption. A secure connection is indicated by the browser changing from \"http://\" to \"https://\" and the lock symbol in the browser address bar.",
            "sslText2": "When SSL or TLS encryption is enabled, the data you transmit cannot be read by third parties.",
            "advertisingEmailsHeadline": "Objection to Advertising Emails",
            "advertisingEmailsText": "The use of contact information published within the framework of the imprint obligation to send unsolicited advertising and information materials is hereby objected to. The operators of the site expressly reserve the right to take legal action in the event of unsolicited sending of advertising information, such as spam emails."
        },
        "dataCollectionOnTheWebsite": {
            "dataCollectionHeadline": "3. Data Collection on This Website",
            "cookiesText1": "Our websites use so-called \"cookies.\" Cookies are small data packages and do not harm your device. They are either stored temporarily for the duration of a session (session cookies) or permanently on your device. Session cookies are automatically deleted at the end of your visit. Permanent cookies remain on your device until you delete them yourself or automatic deletion occurs via your browser.",
            "cookiesText2": "Sometimes, cookies from third parties may also be stored on your device when you visit our site (third-party cookies). These allow us or you to use certain services of the third party (e.g., cookies for processing payment services).",
            "cookiesText3": "Cookies have various functions. Many cookies are technically necessary because certain website functions would not work without them (e.g., shopping cart or video display). Other cookies are used to analyze user behavior or display advertising.",
            "cookiesText4": "Cookies necessary for electronic communication, providing certain requested functions (e.g., shopping cart), or optimizing the website (e.g., measuring web traffic) are stored based on Art. 6(1)(f) GDPR, unless another legal basis is specified. The website operator has a legitimate interest in storing necessary cookies for error-free and optimized provision of services. If consent for storing cookies or similar recognition technologies was obtained, processing is based exclusively on this consent (Art. 6(1)(a) GDPR and ยง25(1) TTDSG); consent can be revoked at any time.",
            "cookiesText5": "You can configure your browser to be informed about cookie settings and allow cookies only in individual cases, exclude them in general, or automatically delete cookies when closing the browser. Deactivating cookies may limit website functionality.",
            "cookiesText6": "If third-party cookies or cookies for analysis purposes are used, we will inform you separately in this privacy policy and, if applicable, request consent.",
            "contactFormHeadline": "Contact Form",
            "contactFormText1": "If you send inquiries via the contact form, your details from the form, including the contact data provided, will be stored for handling the request and for follow-up questions. These data will not be shared without your consent.",
            "contactFormText2": "Processing is based on Art. 6(1)(b) GDPR if your request is related to contract fulfillment or pre-contractual measures. In all other cases, processing is based on our legitimate interest in effective handling of inquiries (Art. 6(1)(f) GDPR) or on your consent (Art. 6(1)(a) GDPR), if obtained; consent can be revoked at any time.",
            "contactFormText3": "The data you provide in the contact form remains with us until you request deletion, withdraw consent, or the purpose for storage no longer applies (e.g., after your request has been handled). Mandatory legal requirements - especially retention periods - remain unaffected.",
            "inquiriesHeadline": "Inquiries by Email, Phone, or Fax",
            "inquiriesText1": "If you contact us via email, phone, or fax, your request, including all resulting personal data (name, request), will be stored and processed for handling your matter. These data will not be shared without your consent.",
            "inquiriesText2": "Processing is based on Art. 6(1)(b) GDPR if your request is related to contract fulfillment or pre-contractual measures. Otherwise, it is based on our legitimate interest in handling inquiries effectively (Art. 6(1)(f) GDPR) or your consent (Art. 6(1)(a) GDPR), if obtained; consent can be revoked at any time.",
            "inquiriesText3": "The data sent via contact requests remains with us until you request deletion, withdraw consent, or the purpose for storage no longer applies (e.g., after handling your matter). Mandatory legal requirements - especially retention periods - remain unaffected."
        },
        "pluginsAndTools": {
            "myFontsHeadline": "My Fonts",
            "myFontsText1": "This site uses My Fonts. These are fonts loaded into your browser when you visit our website to ensure a uniform appearance. The provider is Monotype Imaging Holdings Inc., 600 Unicorn Park Drive, Woburn, Massachusetts 01801, USA.",
            "myFontsText2": "To comply with license conditions and check the number of monthly page views, MyFonts transfers your IP address along with the URL of our website and our contract data to its servers in the USA. According to Monotype, your IP address is anonymized immediately after transfer so that no personal reference can be established (anonymization).",
            "myFontsText3": "For details, see Monotype's privacy policy at:"
        },
        "footer": {
            "source": "Source:"
        }
    }
}